#+title: Preparation
#+author: Erik An
#+email: obluda2173@gmail.com
#+date: <2026-02-21>
#+lastmod: <2026-02-22 19:41>
#+latex: \newpage
#+latex_header: \setlength{\parindent}{0pt}
#+latex_header: \setlength{\parskip}{1em}
#+latex_header: \usepackage{amsmath}
#+latex_header: \usepackage{amssymb}
#+latex_header: \usepackage{amsthm}
#+latex_header: \usepackage[margin=1in]{geometry}
#+options: num:t
#+startup: overview latexpreview inlineimages

**** (d)

#+begin_src julia :results output :exports both :tangle julia/p_10_d.jl
function forward_substitution(L, b)
    n = size(L, 1)
    y = zeros(Float64, n)

    for i in 1:n
        sum = b[i]

        for j in 1:(i-1)
            sum -= L[i, j] * y[j]
        end

        y[i] = sum / L[i, i]
    end
    return y
end

function backward_substitution(U, y)
    n = size(U, 1)
    x = zeros(Float64, n)

    for i in n:-1:1
        sum = y[i]

        for j in (i+1):n
            sum -= U[i, j] * x[j]
        end
        x[i] = sum / U[i, i]
    end
    return x
end

L = [ 1  0  0;
      2  1  0;
     -1  2  1]

U = [ 2  1 -1;
      0  3 -1;
      0  0 -1]

b = [ 1;
      7;
      3]

y = forward_substitution(L, b)
x = backward_substitution(U, y)

println("Intermediate vector y: ", y)
println("Final solution x: ", x)
#+end_src

#+RESULTS:
#+begin_example
forward_substitution (generic function with 1 method)
backward_substitution (generic function with 1 method)
3×3 Matrix{Int64}:
  1  0  0
  2  1  0
 -1  2  1
3×3 Matrix{Int64}:
 2  1  -1
 0  3  -1
 0  0  -1
3-element Vector{Int64}:
 1
 7
 3
3-element Vector{Float64}:
  1.0
  5.0
 -6.0
3-element Vector{Float64}:
 1.6666666666666667
 3.6666666666666665
 6.0
Intermediate vector y: [1.0, 5.0, -6.0]
Final solution x: [1.6666666666666667, 3.6666666666666665, 6.0]
#+end_example

